Autodesk.Revit.DB.NumberingFormattedParameter.GetParameter
Get the target parameter for formatting.

Autodesk.Revit.DB.NumberingFormattedParameter.SetParameter(Autodesk.Revit.DB.NumberingParameter)
Set the target parameter for formatting.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.NumberingFormattedParameter.Separator
Separators corresponding to the included parameter.

Autodesk.Revit.DB.NumberingFormattedParameter.Suffix
Suffix corresponding to the included parameter.

Autodesk.Revit.DB.NumberingFormattedParameter.SampleValue
Sample values corresponding to the included parameter.

Autodesk.Revit.DB.NumberingFormattedParameter.Prefix
Prefix corresponding to the included parameter.

Autodesk.Revit.DB.NumberingFormattedParameter.#ctor
Create an empty NumberingFormattedParameter object.

Autodesk.Revit.DB.NumberingFormattedParameter
Settings for parameters associated in the numbering formatting.